# Insert

In [8]:
import pandas as pd

var =pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5]})
var.insert(1,"python",var["A"])
var.insert(1,"Python_1",[11,12,13,14,15])
var

   A  Python_1  python  B
0  1        11       1  9
1  2        12       2  8
2  3        13       3  7
3  4        14       4  6
4  5        15       5  5

In [9]:
var["python_12"]=var["A"][:3]
var

   A  Python_1  python  B  python_12
0  1        11       1  9        1.0
1  2        12       2  8        2.0
2  3        13       3  7        3.0
3  4        14       4  6        NaN
4  5        15       5  5        NaN

# Delete

In [16]:
var.pop("python")
var

   Python_1  python_12
0        11        1.0
1        12        2.0
2        13        3.0
3        14        NaN
4        15        NaN

In [17]:
var

   Python_1  python_12
0        11        1.0
1        12        2.0
2        13        3.0
3        14        NaN
4        15        NaN

In [18]:
del var["Python_1"]

In [19]:
var

   python_12
0        1.0
1        2.0
2        3.0
3        NaN
4        NaN